Revit 2024 API
SpecTypeId.Reference.Material Property
 Material, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId Material { get; }
Visual Basic
Public Shared ReadOnly Property Material As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Material {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace